# ----------------------------------------------------------------------------
# [baekjoon_1789] 수들의 합
# ----------------------------------------------------------------------------
import sys
input = sys.stdin.readline

S = int(input())
cnt = 0
total = 0
while True:
    cnt += 1
    total += cnt
    if total > S:
        break

print(cnt -1)
# 요약
# 서로다른 N개의 자연수의 합이 S라고한다. S를 알때 자연수 N의 최댓값은?

# 풀이
# 1 + 2 + 3 + 4 .... 9 = 45
# 11 + 12 + ... 20 = 195
# 45 + 11 + 12 + 13 + 14 + 15 + 16 + 17 + 18 + 19 + 20