# ----------------------------------------------------------------------------
# [baekjoon] Z 
# 1. r,c 1~4사분면중 어느것이지 골라 맨왼쪽 위 배열이 몇인지 탐색
# 2. 각각 사분면의 맨왼쪽 크기는 2*N-1 * 2*N-1 크기만큼 증가
# 3. 
# ----------------------------------------------------------------------------
import sys
input = sys.stdin.readline

n, r, c = map(int, input().split())

ans = 0

while n != 0:
    n -= 1

    # 1사분면
    if r<2**n and c < 2 **n:
        ans += (2**n) * (2 ** n) * 0
    # 2사분면
    elif r < 2**n and c >= 2**n:
        ans += (2**n) * (2**n) * 1
        c -= (2**n)
    # 3사분면
    elif r >= 2**n and c < 2**n:
        ans += (2**n) * (2**n) * 2
        r -= (2**n)
    # 4사분면
    else:
        ans += (2**n) * (2**n) * 3
        r -= (2**n)
        c -= (2**n)

print(ans)